cases/Biofilm_growth/multi_pores/c/cyclic-c-1e-4/0/MbbyMmax
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField    nonuniform List<scalar> 
31250
(
0
0
0
0
0
0
0
0
...
0

);


boundaryField
{

    left
    {
         type            fixedValue;
       value	       uniform 0;
    }

    right
    {
       
         type            fixedValue;
       value	       uniform 0;
    }

    bottom
    {
       type            cyclic;
    }
    top
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
